# St7DeleteProperty

Deletes the specified material property.

long St7DeleteProperty(long uID, long Entity, long PropNum)

Input Parameters

uID

Strand7 model file ID.

Entity

One of ptBEAMPROP, ptPLATEPROP, ptBRICKPROP or ptPLYPROP.

PropNum

Entity property number.